# Fire up Pandas

In [1]:
import pandas as pd # or just import pandas

# Load a tabular data set

In [2]:
frame = pd.read_csv('..\Datasets\people-example.csv')

In [3]:
frame

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [6]:
frame.head()
# TASK: try printing first 6 rows using the 'head' method

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23

In [7]:
# TASK: try printing last 2 rows using the 'tail' method
frame

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

# Pandas functions

In [19]:
frame.describe()

             age
count   7.000000
mean   23.142857
std     1.069045
min    22.000000
25%    22.500000
50%    23.000000
75%    23.500000
max    25.000000

In [20]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
First Name    7 non-null object
Last Name     7 non-null object
Country       7 non-null object
age           7 non-null int64
dtypes: int64(1), object(3)
memory usage: 304.0+ bytes

# Inspect columns of dataset

In [21]:
frame['Country']

0    United States
1           Canada
2          England
3              USA
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [24]:
# TASK: try printing other columns 
frame['']

In [25]:
frame.columns

Index(['First Name', 'Last Name', 'Country', 'age'], dtype='object')

In [37]:
frame.iloc[1:4]

  First Name Last Name  Country  age
1      Alice  Williams   Canada   23
2    Malcolm      Jone  England   22
3      Felix     Brown      USA   23

# Column functions

## A column of a DataFrame can be referred in 2 ways
- frame['col_name']
- frame.col_name

In [39]:
frame['Country']

0    United States
1           Canada
2          England
3              USA
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [47]:
frame.age.max()
# TASK: try min(), mean(), median()

25

In [48]:
frame['Country'].unique()

array(['United States', 'Canada', 'England', 'USA', 'Poland',
       'Switzerland'], dtype=object)

# Transforming our DataFrame and cleaning the data

There are two instances of United States: 'United States' and 'USA', so let's clean that up

In [52]:
frame.loc[frame['Country'] == 'USA', 'Country'] = 'United States'

In [53]:
frame

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown  United States   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

If we really wanted to use a function on the data, let's look at how that is performed
# Using the apply function to do an advance transformation of our data

In [54]:
frame = pd.read_csv('..\Datasets\people-example.csv')

Define our function

In [55]:
def transform_country(country):
    if country == 'USA':
        return 'United States'
    else:
        return country

In [56]:
frame['Country'].apply(transform_country)

0    United States
1           Canada
2          England
3    United States
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [57]:
frame['Country'] = frame['Country'].apply(transform_country)

In [58]:
frame

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown  United States   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

# For more information on Pandas

[Panda data frames](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html)